app/Controllers/UserController.php

    public function deleteUser($id){
        $data = array();
        if($this->request->getMethod() == 'delete'){
            $userModel = new UserModel();
            $userModel->delete($id);
            return redirect()->to('/');
        }
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'